erp3l/src/Documents/ОперацияМеждународный/ОперацияМеждународный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияМеждународный</name>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьПериодПоСтрокам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетов</name>
    <type>
      <types>CatalogRef.ПланыСчетовМеждународногоУчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаполнениеДвижений</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
        <types>DocumentRef.ПодготовкаКПередачеНМА</types>
        <types>DocumentRef.СписаниеОС</types>
        <types>DocumentRef.ЗаписьКнигиПокупок</types>
        <types>DocumentRef.АмортизацияОСМеждународныйУчет</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ПередачаДавальцу</types>
        <types>DocumentRef.ПеремещениеМатериаловВПроизводстве</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПереоценкаНМА2_4</types>
        <types>DocumentRef.ПередачаОСВАренду</types>
        <types>DocumentRef.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
        <types>DocumentRef.СчетФактураПолученныйАванс</types>
        <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
        <types>DocumentRef.ПоступлениеУслугПоАренде</types>
        <types>DocumentRef.ИнойДокументПодтвержденияНДС</types>
        <types>DocumentRef.ЭтапПроизводства2_2</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ОтчетДавальцу</types>
        <types>DocumentRef.ПодготовкаКПередачеНМА2_4</types>
        <types>DocumentRef.ПринятиеКУчетуОС</types>
        <types>DocumentRef.Бронирование</types>
        <types>DocumentRef.АмортизацияНМА</types>
        <types>DocumentRef.ВнесениеДенежныхСредствВКассуККМ</types>
        <types>DocumentRef.РасчетКурсовыхРазниц</types>
        <types>DocumentRef.ПоступлениеСырьяОтДавальца</types>
        <types>DocumentRef.НачислениеОценочныхОбязательствПоОтпускам</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.СписаниеОС2_4</types>
        <types>DocumentRef.ИзменениеПараметровОС2_4</types>
        <types>DocumentRef.РаспределениеПроизводственныхЗатрат</types>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.СчетФактураНаНеподтвержденнуюРеализацию0</types>
        <types>DocumentRef.ВводОстатковДенежныхСредств</types>
        <types>DocumentRef.ОперацияБух</types>
        <types>DocumentRef.РегламентнаяОперацияМеждународныйУчет</types>
        <types>DocumentRef.АмортизацияНМАМеждународныйУчет</types>
        <types>DocumentRef.ВозвратОСИзАренды2_4</types>
        <types>DocumentRef.ОбесценениеВНА</types>
        <types>DocumentRef.АктВыполненныхВнутреннихРабот</types>
        <types>DocumentRef.ВводОстатковТМЦВЭксплуатации</types>
        <types>DocumentRef.ВводОстатков</types>
        <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
        <types>DocumentRef.ПринятиеКУчетуОСМеждународныйУчет</types>
        <types>DocumentRef.ОбъединениеОС</types>
        <types>DocumentRef.ПрочиеДоходыРасходы</types>
        <types>DocumentRef.ИзменениеПараметровНМАМеждународныйУчет</types>
        <types>DocumentRef.ОперацияМеждународный</types>
        <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
        <types>DocumentRef.СчетФактураВыданныйАванс</types>
        <types>DocumentRef.ВводОстатковОСМеждународныйУчет</types>
        <types>DocumentRef.ВводОстатковНМАМеждународныйУчет</types>
        <types>DocumentRef.КорректировкаНалогообложенияНДСПартийТоваров</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
        <types>DocumentRef.СписаниеНМАМеждународныйУчет</types>
        <types>DocumentRef.ПеремещениеОС2_4</types>
        <types>DocumentRef.ПеремещениеНМАМеждународныйУчет</types>
        <types>DocumentRef.РаспределениеРасходовБудущихПериодов</types>
        <types>DocumentRef.РазукомплектацияОС</types>
        <types>DocumentRef.МодернизацияОС</types>
        <types>DocumentRef.ПогашениеСтоимостиТМЦВЭксплуатации</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>DocumentRef.МодернизацияОС2_4</types>
        <types>DocumentRef.СписаниеНДСНаРасходы</types>
        <types>DocumentRef.СписаниеНедостачТоваров</types>
        <types>DocumentRef.РаспределениеПрочихЗатрат</types>
        <types>DocumentRef.ПоступлениеТоваровОтХранителя</types>
        <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>DocumentRef.ВозвратСырьяДавальцу</types>
        <types>DocumentRef.ПодготовкаКПередачеОС2_4</types>
        <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
        <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.ПереоценкаОС2_4</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.Сторно</types>
        <types>DocumentRef.ПередачаТоваровХранителю</types>
        <types>DocumentRef.АмортизацияОС</types>
        <types>DocumentRef.ОтчетОператораСистемыПлатон</types>
        <types>DocumentRef.ПодготовкаКПередачеОС</types>
        <types>DocumentRef.ВводОстатковНДСПредъявленного</types>
        <types>DocumentRef.РасчетРезервовПодОбесценениеЗапасов</types>
        <types>DocumentRef.ПоступлениеАрендованныхОС</types>
        <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
        <types>DocumentRef.ВводОстатковВнеоборотныхАктивов2_4</types>
        <types>DocumentRef.ПереоценкаНМА</types>
        <types>DocumentRef.ПередачаСырьяПереработчику</types>
        <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
        <types>DocumentRef.ВводОстатковВнеоборотныхАктивов</types>
        <types>DocumentRef.КорректировкаНазначенияТоваров</types>
        <types>DocumentRef.ПересортицаТоваров</types>
        <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
        <types>DocumentRef.ВводОстатковРасходовПриУСН</types>
        <types>DocumentRef.ПоступлениеДенежныхДокументов</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПринятиеКУчетуНМА2_4</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
        <types>DocumentRef.НачислениеДивидендов</types>
        <types>DocumentRef.КорректировкаПриобретения</types>
        <types>DocumentRef.СчетФактураВыданный</types>
        <types>DocumentRef.ОтчетКомитентуОСписании</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
        <types>DocumentRef.ПереоценкаОС</types>
        <types>DocumentRef.ПеремещениеОСМеждународныйУчет</types>
        <types>DocumentRef.ПеремещениеНМА2_4</types>
        <types>DocumentRef.АмортизацияНМА2_4</types>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
        <types>DocumentRef.АннулированиеПодарочныхСертификатов</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
        <types>DocumentRef.СписаниеНМА2_4</types>
        <types>DocumentRef.ВводОстатковПоФинансовымИнструментам</types>
        <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
        <types>DocumentRef.ПринятиеКУчетуОС2_4</types>
        <types>DocumentRef.ИзменениеПараметровОС</types>
        <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
        <types>DocumentRef.КорректировкаСтоимостиИАмортизацииОС</types>
        <types>DocumentRef.ОтчетОРозничныхВозвратах</types>
        <types>DocumentRef.ВозвратСырьяОтПереработчика</types>
        <types>DocumentRef.СписаниеЗадолженности</types>
        <types>DocumentRef.ВыпускПродукции</types>
        <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
        <types>DocumentRef.СписаниеПринятыхНаХранениеТоваров</types>
        <types>DocumentRef.СборкаТоваров</types>
        <types>DocumentRef.ПриемкаТоваровНаХранение</types>
        <types>DocumentRef.СписаниеОСМеждународныйУчет</types>
        <types>DocumentRef.СписаниеТоваровУХранителя</types>
        <types>DocumentRef.ПроизводствоБезЗаказа</types>
        <types>DocumentRef.ОтчетКомиссионераОСписании</types>
        <types>DocumentRef.АмортизацияОС2_4</types>
        <types>DocumentRef.ВозвратМатериаловИзПроизводства</types>
        <types>DocumentRef.ВводОстатковТоваров</types>
        <types>DocumentRef.ВыкупАрендованныхОС</types>
        <types>DocumentRef.ВводОстатковПрочиеРасходы</types>
        <types>DocumentRef.ПринятиеКУчетуНМАМеждународныйУчет</types>
        <types>DocumentRef.СчетФактураКомиссионеру</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
        <types>DocumentRef.ИзменениеПараметровНМА2_4</types>
        <types>DocumentRef.ВозвратОСИзАренды</types>
        <types>DocumentRef.ВыкупВозвратнойТарыУПоставщика</types>
        <types>DocumentRef.РегламентнаяОперация</types>
        <types>DocumentRef.ВзаимозачетЗадолженности</types>
        <types>DocumentRef.ДепонированиеЗарплаты</types>
        <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
        <types>DocumentRef.РасчетСебестоимостиТоваров</types>
        <types>DocumentRef.СчетФактураПолученный</types>
        <types>DocumentRef.ПрочееОприходованиеТоваров</types>
        <types>DocumentRef.ВосстановлениеНДСПоОбъектамНедвижимости</types>
        <types>DocumentRef.НачисленияКредитовИДепозитов</types>
        <types>DocumentRef.КорректировкаСтоимостиИАмортизацииНМА</types>
        <types>DocumentRef.РеализацияПодарочныхСертификатов</types>
        <types>DocumentRef.ИзменениеПараметровОСМеждународныйУчет</types>
        <types>DocumentRef.ЗаписьКнигиПродаж</types>
        <types>DocumentRef.ПеремещениеОС</types>
        <types>DocumentRef.ПризнаниеРасходовПоИсследованиямИРазработкам</types>
        <types>DocumentRef.ВозвратПодарочныхСертификатов</types>
        <types>DocumentRef.ВводОстатковОПродажахЗаПрошлыеПериоды</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ВыкупТоваровХранителем</types>
        <types>DocumentRef.ПередачаОСВАренду2_4</types>
        <types>DocumentRef.ПередачаМатериаловВПроизводство</types>
        <types>DocumentRef.ВводОстатковВзаиморасчетов</types>
        <types>DocumentRef.ВводОстатковРасчетовПоЭквайрингу</types>
        <types>DocumentRef.ПринятиеКУчетуНМА</types>
        <types>DocumentRef.СчетФактураПолученныйНалоговыйАгент</types>
        <types>DocumentRef.ВводОстатковСПодотчетниками</types>
        <types>DocumentRef.ПорчаТоваров</types>
        <types>DocumentRef.ПоступлениеОтПереработчика</types>
        <types>DocumentRef.СписаниеНМА</types>
        <types>DocumentRef.ВыбытиеАрендованныхОС</types>
        <types>DocumentRef.СчетФактураНалоговыйАгент</types>
        <types>DocumentRef.ЗаключениеДоговораАренды</types>
        <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете2_5</types>
        <types>DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</types>
        <types>DocumentRef.РаспределениеНДС</types>
        <types>DocumentRef.ОтчетКомитентуОЗакупках</types>
        <types>DocumentRef.ВводОстатковПрочихАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/ОперацияМеждународный/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Команда = Документы.ОперацияМеждународный.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	Если Команда <> Неопределено Тогда
		Команда.Представление = НСтр("ru = 'Сторно: Операция (международный учет):';
									|en = 'Storno: Transaction (financial accounting):'");
	КонецЕсли;
	
КонецПроцедуры

// Добавляет команду создания документа "Операция (международный учет)".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - Добавить команду создать на основании:
// * Представление - Строка -
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.ОперацияМеждународный) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.ОперацияМеждународный.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.ОперацияМеждународный);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьМеждународныйФинансовыйУчет";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Возврат; //В дальнейшем будет добавлен код команд
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Документы.ОперацияМеждународный.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.6.14";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("740f5bd4-55cf-4bb3-8845-d5f15da962ca");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Документы.ОперацияМеждународный.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Заполняет реквизит ""План счетов"".';
									|en = 'Fills in ""Chart of accounts"" attribute.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Документы.ОперацияМеждународный.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.ПланыСчетовМеждународногоУчета.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Документы.ОперацияМеждународный.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "МультиязычностьСервер.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОперацияМеждународный КАК Документ
	|ГДЕ
	|	Документ.ПланСчетов = ЗНАЧЕНИЕ(Справочник.ПланыСчетовМеждународногоУчета.ПустаяСсылка)";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = ПустаяСсылка().Метаданные().ПолноеИмя();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Для Каждого Документ Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Ссылка = Документ.Ссылка;
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
			Блокировка.Заблокировать();
			
			ДокументОбъект = Ссылка.ПолучитьОбъект(); //ДокументОбъектОперацияМеждународный -

			Если ДокументОбъект <> Неопределено Тогда
				Если Не ЗначениеЗаполнено(ДокументОбъект.ПланСчетов) Тогда
					ДокументОбъект.ПланСчетов = Справочники.ПланыСчетовМеждународногоУчета.Международный;
				КонецЕсли;
			КонецЕсли;
			
			Если ДокументОбъект <> Неопределено И ДокументОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Ссылка);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Документ.Ссылка);
			
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
